1. Pandas is used to analyze big data and make conclusions based on statistical theories

2. Pandas is typically used to clean messy data and make them readable and simple to access

3. Pandas can give co-relation between two or more columns

4. It can also help us in doing all statistical methodologies as well as ploting and creating graphs

5. Pandas allow various data manipulation operations such as merging, sekecting as well as  data cleaning

6. Pandas allow importing data from various file formats sudh as JSON,SQL,microsoft excel

7. we can handle null values and do various operations related with stats

8. We can also use various inbuild graphs and charts available in pandas and can generate reports

In [1]:
import pandas as pd
import numpy as np

In [2]:
array_1 = np.array([10,20,30,40,50])

In [3]:
print(array_1)

[10 20 30 40 50]

## Series

A series is a 1 Dimensional Array like oject containing sequence of values (similar to that of numoy) and an associated array of data label called as indexes

In [4]:
#How to create Series
series_1 = pd.Series([10,20,30,40,50])
# here make shure 'S' is uppercase

In [5]:
print(series_1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

in Series we also can give custom indexing

In [6]:
array_2 = [10,20,30,40,50]
index = ['a','b','c','d','e']
series_2 = pd.Series(array_2,index=index)

In [7]:
print(series_2)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
# How to access element using custom index
print(series_2['a'],series_2['b'],series_2['e'])

10 20 50

In [9]:
series_4 = pd.Series(
    [200,300,400,500],
    index = ['Mumbai','Chennai','Delhi','Jaipur']
)
print(series_4)

Mumbai     200
Chennai    300
Delhi      400
Jaipur     500
dtype: int64

In [10]:
# How to viw only indexes
series_4.index

Index(['Mumbai', 'Chennai', 'Delhi', 'Jaipur'], dtype='object')

In [11]:
# How to update value at perticular index
series_4['Delhi']=700

In [12]:
print(series_4)

Mumbai     200
Chennai    300
Delhi      700
Jaipur     500
dtype: int64

In [13]:
# How to get output using filteration boolean
series_4 >= 300

Mumbai     False
Chennai     True
Delhi       True
Jaipur      True
dtype: bool

In [14]:
# How to get actual values after filter
series_4[series_4 > 300]

Delhi     700
Jaipur    500
dtype: int64

In [15]:
series_4[series_4 < 300]

Mumbai    200
dtype: int64

In [16]:
series_5 = pd.Series(
    [200,300,400,500],
    index = ['Mumbai','Chennai','Delhi','Jaipur']
)
print(series_5)

Mumbai     200
Chennai    300
Delhi      400
Jaipur     500
dtype: int64

how to perform some basic operations

In [17]:
result_1 = series_5 * 2

In [18]:
print(result_1)

Mumbai      400
Chennai     600
Delhi       800
Jaipur     1000
dtype: int64

In [19]:
print("Before appling multiplication : ")
print(series_5)

Before appling multiplication :
Mumbai     200
Chennai    300
Delhi      400
Jaipur     500
dtype: int64

In [20]:
series_5 *= 2

In [21]:
print('after appling multiplication : ')
print(series_5)

after appling multiplication :
Mumbai      400
Chennai     600
Delhi       800
Jaipur     1000
dtype: int64

## Creating Series using Dictionary

In [22]:
cities = {
    'Pune':35_000,
    'Nagpur':49_000,
    'Mumbai':88_000,
    'Nasik':30_000
}

In [23]:
print(cities)

{'Pune': 35000, 'Nagpur': 49000, 'Mumbai': 88000, 'Nasik': 30000}

In [24]:
series_6 = pd.Series(cities)

In [25]:
print(series_6)

Pune      35000
Nagpur    49000
Mumbai    88000
Nasik     30000
dtype: int64

In [26]:
cities_2 = {
    'Pune':35_000,
    'Nagpur':49_000,
    'Mumbai':88_000,
    'Nashik':30_000,
    'delhi':None
}

In [27]:
series_7 = pd.Series(cities_2)

In [28]:
print(series_7)

Pune      35000.0
Nagpur    49000.0
Mumbai    88000.0
Nashik    30000.0
delhi         NaN
dtype: float64

## Identifying not null values

In [29]:
print(series_7)

Pune      35000.0
Nagpur    49000.0
Mumbai    88000.0
Nashik    30000.0
delhi         NaN
dtype: float64

In [30]:
pd.isnull(series_7)
# isnull will return true if value is nan or None
# else it will return false

Pune      False
Nagpur    False
Mumbai    False
Nashik    False
delhi      True
dtype: bool

In [31]:
pd.notnull(series_7)
# notnull is opposite of isnull
# this will return True if value in not nan or not None
# else it will return False

Pune       True
Nagpur     True
Mumbai     True
Nashik     True
delhi     False
dtype: bool

In [32]:
print(series_7)

Pune      35000.0
Nagpur    49000.0
Mumbai    88000.0
Nashik    30000.0
delhi         NaN
dtype: float64

In [34]:
series_8 = pd.Series(
    {
        'Pune':1000,
        'Nagpur':2000,
        'Chennai':3000,
        'Delhi':4000,
        'Mumbai':5000
    }
)
print(series_8)

Pune       1000
Nagpur     2000
Chennai    3000
Delhi      4000
Mumbai     5000
dtype: int64

In [37]:
series_9 = series_7 + series_8

In [38]:
print(series_9)

Chennai        NaN
Delhi          NaN
Mumbai     93000.0
Nagpur     51000.0
Nashik         NaN
Pune       36000.0
delhi          NaN
dtype: float64

from above example we can clearly see that to add series_7 and series_8 
they both need same indixes in case of custom indexes

In [40]:
series_10 = pd.Series(
    ['Mum','Del','Hyd'],
    index = ['A','B','C']
)

series_11 = pd.Series(
    ['Mah','Ind','Ap'],
    index = ['A','P','Q']
)

print(f"{series_10}\n\n{series_11}")

A    Mum
B    Del
C    Hyd
dtype: object

A    Mah
P    Ind
Q     Ap
dtype: object

In [42]:
series_12 = series_10 + series_11

In [43]:
print(series_12)

A    MumMah
B       NaN
C       NaN
P       NaN
Q       NaN
dtype: object

## Data Frame

A DataFrame represents a rectangular table of data and containts ordered 
collection of columns each of which can be different data type (Numeric,Boolean,String,etc.)

The Dataframe has both row and column index,it can e thought as a collection of series all sharing the same index.The data is stored in one or more 2-D block rather than a list or dictionary or other collection of 1-D array

how to create dataFrame

In [44]:
data = {
    'State':['Mumbai','Pune','Chennai','Nagput','Delhi'],
    'year':[2001,20011,2018,2019,2020],
    'pop':[1.5,1.6,1.7,3.6,3.2]
}

In [45]:
df1 = pd.DataFrame(data)

In [46]:
print(df1)

     State   year  pop
0   Mumbai   2001  1.5
1     Pune  20011  1.6
2  Chennai   2018  1.7
3   Nagput   2019  3.6
4    Delhi   2020  3.2

In [47]:
df1

     State   year  pop
0   Mumbai   2001  1.5
1     Pune  20011  1.6
2  Chennai   2018  1.7
3   Nagput   2019  3.6
4    Delhi   2020  3.2

In [49]:
#how to access columns
print(df1['State'],end='\n\n')
print(df1['year'],end='\n\n')
print(df1['pop'],end='\n\n')

0     Mumbai
1       Pune
2    Chennai
3     Nagput
4      Delhi
Name: State, dtype: object

0     2001
1    20011
2     2018
3     2019
4     2020
Name: year, dtype: int64

0    1.5
1    1.6
2    1.7
3    3.6
4    3.2
Name: pop, dtype: float64

In [50]:
# How to print first n number of values
df1.head(3)

     State   year  pop
0   Mumbai   2001  1.5
1     Pune  20011  1.6
2  Chennai   2018  1.7

In [51]:
df1.head() #head is used to fetch the top part of data

     State   year  pop
0   Mumbai   2001  1.5
1     Pune  20011  1.6
2  Chennai   2018  1.7
3   Nagput   2019  3.6
4    Delhi   2020  3.2

how to fetch last part of data

In [52]:
df1.tail(2)

    State  year  pop
3  Nagput  2019  3.6
4   Delhi  2020  3.2

Custom indexing in pandas DataFrame

In [54]:
df2 = pd.DataFrame(
    data,
    index = ['one','two','three','four','five']
)

In [55]:
df2

         State   year  pop
one     Mumbai   2001  1.5
two       Pune  20011  1.6
three  Chennai   2018  1.7
four    Nagput   2019  3.6
five     Delhi   2020  3.2

In [56]:
df2['State']

one       Mumbai
two         Pune
three    Chennai
four      Nagput
five       Delhi
Name: State, dtype: object

In [57]:
df2['year']

one       2001
two      20011
three     2018
four      2019
five      2020
Name: year, dtype: int64

In [58]:
df2['pop']

one      1.5
two      1.6
three    1.7
four     3.6
five     3.2
Name: pop, dtype: float64

fetching data on basis of rows

In [59]:
df2

         State   year  pop
one     Mumbai   2001  1.5
two       Pune  20011  1.6
three  Chennai   2018  1.7
four    Nagput   2019  3.6
five     Delhi   2020  3.2

In [61]:
df2.loc['four']

State    Nagput
year       2019
pop         3.6
Name: four, dtype: object

loc for custom indexes
iloc for default indexes (zero based indexing)

How to add new columns to DataFrame

In [62]:
df2['country'] = 'India'

In [63]:
df2

         State   year  pop country
one     Mumbai   2001  1.5   India
two       Pune  20011  1.6   India
three  Chennai   2018  1.7   India
four    Nagput   2019  3.6   India
five     Delhi   2020  3.2   India

Fetching data on basis of default indexing (i.e. Zero based indexing)

In [64]:
df2.iloc[2]

State      Chennai
year          2018
pop            1.7
country      India
Name: three, dtype: object

NOTE :

loc for custom indexes
iloc for default indexes (zero based indexing)

In [65]:
df2['debt'] = np.arange(1,6)

In [66]:
df2

         State   year  pop country  debt
one     Mumbai   2001  1.5   India     1
two       Pune  20011  1.6   India     2
three  Chennai   2018  1.7   India     3
four    Nagput   2019  3.6   India     4
five     Delhi   2020  3.2   India     5

How to delete perticular column

In [67]:
del(df2['country'])

In [68]:
df2

         State   year  pop  debt
one     Mumbai   2001  1.5     1
two       Pune  20011  1.6     2
three  Chennai   2018  1.7     3
four    Nagput   2019  3.6     4
five     Delhi   2020  3.2     5

In [69]:
df2['country'] = 'India'

In [70]:
df2

         State   year  pop  debt country
one     Mumbai   2001  1.5     1   India
two       Pune  20011  1.6     2   India
three  Chennai   2018  1.7     3   India
four    Nagput   2019  3.6     4   India
five     Delhi   2020  3.2     5   India

In [71]:
start = 100
end = 600
step = 100
df2['budget'] = np.arange(start,end,step)

In [72]:
df2

         State   year  pop  debt country  budget
one     Mumbai   2001  1.5     1   India     100
two       Pune  20011  1.6     2   India     200
three  Chennai   2018  1.7     3   India     300
four    Nagput   2019  3.6     4   India     400
five     Delhi   2020  3.2     5   India     500

In [73]:
df2['budget']

one      100
two      200
three    300
four     400
five     500
Name: budget, dtype: int32

In [74]:
df2['budget']['three']=3000

<ipython-input-74-8e8bf2e5a899>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['budget']['three']=3000

In [75]:
df2

         State   year  pop  debt country  budget
one     Mumbai   2001  1.5     1   India     100
two       Pune  20011  1.6     2   India     200
three  Chennai   2018  1.7     3   India    3000
four    Nagput   2019  3.6     4   India     400
five     Delhi   2020  3.2     5   India     500

## index objects

In [77]:
obj = pd.Series(
    range(3),
    index = ['a','b','c']
)

In [78]:
obj

a    0
b    1
c    2
dtype: int64

In [80]:
obj.index
# this will give/return indexes of series

Index(['a', 'b', 'c'], dtype='object')

In [81]:
indexes = obj.index

In [82]:
indexes

Index(['a', 'b', 'c'], dtype='object')

In [83]:
index[0]

'a'

NOTE :

here you only can access indexs of series but you can't change them

In [84]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [85]:
indexes_2 = df2.index

In [86]:
indexes_2

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [87]:
indexes_2[3]

'four'

## Re-indexing

In [88]:
series_13 = pd.Series(
    [4.1,7.5,-8.3,3.6],
    index = ['d','b','a','c']
)

In [89]:
series_13

d    4.1
b    7.5
a   -8.3
c    3.6
dtype: float64

In [90]:
series_13.reindex(['a','b','c','d'])

a   -8.3
b    7.5
c    3.6
d    4.1
dtype: float64